load-tests/socket-soak.yml
config:
  # Same target as socket-flow.yml, but instead of ramping to find the
  # breaking point, this holds a steady rate comfortably under the ~100/sec
  # connection-churn ceiling found in socket-flow.yml (which turned out to
  # be local Windows loopback port exhaustion, not the app itself) for long
  # enough to reveal slow leaks/degradation the short staged ramps can't.
  target: "http://localhost:3000"
  socketio:
    transports: ["websocket"]
  phases:
    - name: warm up
      duration: 10
      arrivalRate: 10
    - name: soak
      duration: 300
      arrivalRate: 40

scenarios:
  - name: single chat message
    engine: socketio
    flow:
      - emit:
          channel: "user_message"
          data:
            messages:
              - role: "user"
                content: "Say hello in one short sentence."
        response:
          on: "bot_done"
          data:
            fullText: "Hello! This is a mocked reply for load testing."